Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རྗེས་སུ་དྲན་ནས་ཀྱང་དགའ་བ་དང་། མོས་པ་དང་ཉམས་བདེ་བ་ཐོབ་པར་གྱུར་པ་དེ་དག་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་ཞིང་ཕྱིན་ནས་ཞབས་ལ་ཕྱག་འཚལ་ཏེ།
en: Having recollected those lives they felt joy, appreciation, and ease, and departed for where there were blessed ones. On arriving there they paid homage at their feet.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་ཐལ་མོ་སྦྱོར་ཞིང་འདུད་པར་གྱུར་ཏོ། །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དང་།
en: Placing their hands together, they bowed toward those tathāgatas, arhats, completely awakened buddhas.

source: ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། ཕྱོགས་མཚམས་རྣམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་དང་།
en: In the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, and in the world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, the hells, the animal realms, and the worlds of Yama were again all interrupted, and the states that lack freedom vanished.

source: བྱོལ་སོང་གི་སྐྱེ་གནས་ཐམས་ཅད་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱང་རྒྱུན་ཆད། མི་ཁོམ་པ་ཐམས་ཅད་ཀྱང་ནུབ་པར་གྱུར་ཏེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་མི་དང་ལྷར་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ།
en: All the beings in them were reborn equal in fortune to human beings and to the gods.

source: །དེ་ནས་མི་དེ་དག་དང་། ལྷ་དེ་དག་དགའ་བ་དང་། མོས་པ་དང་། ཉམས་བདེ་བ་དེ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་རྗེས་སུ་དྲན་པར་གྱུར་ཏེ།
en: Then those human beings and those gods, with joy, appreciation, and ease, recollected their former lives.

source: རྗེས་སུ་དྲན་ནས་ཀྱང་དགའ་བ་དང་། མོས་པ་དང་། ཉམས་བདེ་བ་ཐོབ་པར་གྱུར་པ་དེ་དག །རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་བཞུགས་པ་དེ་དག་གི་དྲུང་དུ་དོང་ཞིང་ཕྱིན་ནས།
en: Having recollected those lives they felt joy, appreciation, and ease, and each departed for the buddhafields where those respective tathāgatas, arhats, completely awakened buddhas resided.

source: ཞབས་ལ་ཕྱག་འཚལ་ཏེ།
en: On arriving there they paid homage at their feet.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་ཐལ་མོ་སྦྱོར་ཞིང་འདུད་པར་གྱུར་ཏོ།
en: Placing their hands together, they bowed toward those tathāgatas, arhats, completely awakened buddhas.

source: །དེ་ནས་དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། སེམས་ཅན་དམུས་ལོང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། མིག་གིས་གཟུགས་མཐོང་བར་གྱུར་ཏོ།
en: At that time, in this great trichiliocosm, all those who were blind, as many as there were, saw sights.

source: །འོན་པ་རྣམས་ཀྱང་རྣ་བས་སྒྲ་ཐོས་པར་གྱུར་ཏོ།
en: Those who were deaf heard sounds.

source: །སྨྱོན་པ་རྣམས་ཀྱང་དྲན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were insane regained their wits.

source: །སེམས་འཁྲུགས་པ་རྣམས་ཀྱང་འཁྲུག་པ་མེད་པའི་སེམས་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were agitated attained a state of mind without agitation.

source: །གོས་མེད་པ་རྣམས་ཀྱང་གོས་ཐོབ་པར་གྱུར་ཏོ།
en: Those without clothing obtained clothing.

source: །དབུལ་པོ་རྣམས་ཀྱང་ནོར་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were destitute obtained wealth.

source: །བཀྲེས་པ་རྣམས་ཀྱང་ཟས་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were hungry obtained food.

source: །སྐོམ་པ་རྣམས་ཀྱང་བཏུང་བ་ཐོབ་པར་གྱུར་ཏོ།
en: Those who were thirsty obtained drink.

source: །ནད་ཀྱིས་བཏབ་པ་རྣམས་ཀྱང་ནད་མེད་པར་གྱུར་ཏོ།
en: Those afflicted with ill health became free from disease.

source: །ལུས་ཉམས་པ་དང་དབང་པོ་མ་ཚང་བ་རྣམས་ཀྱང་ལུས་དང་དབང་པོ་ཚང་ཞིང་རྒྱས་པར་གྱུར་ཏོ། །ངལ་བ་རྣམས་ཀྱང་ངལ་སོས་པར་གྱུར་ཏེ། ལུས་དང་ངག་དང་།
en: Those with physical disabilities and imperfect sense faculties were restored to full perfection of body and senses, and flourished.

source: ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་དང་།
en: Those who were weary were refreshed.

source: འཚོ་བ་མི་དགེ་བ་མ་སྤངས་པ་རྣམས་ཀྱང་། ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་ཀྱི་མཐའ་དང་འཚོ་བ་མི་དགེ་བ་སྤངས་པར་གྱུར་ཏོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ། དཔེར་ན་ཕ་དང་། མ་དང་། ཕུ་ནུ་དང་།
en: Those who had not forsaken nonvirtuous ways of acting and livelihood of body, speech, and mind forsook those nonvirtuous ways of acting and livelihood of body, speech, and mind. {

source: སྲིང་མོ་དང་། མཛའ་བ་དང་། གཉེན་པ་དང་། གྲོགས་པོ་དང་། མཚུངས་པའི་སེམས་ཀྱིས་ཕན་ཚུན་སེམས་མཉམ་པ་ཉིད་དུ་གྱུར་ཏོ།
en: Dt.10} All beings too became even-minded toward all other beings, considering one another as just like their father, mother, brother, sister, partner, ally, or friend.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་ཞིང་ཚངས་པར་སྤྱོད་པ་དང་། གཙང་བ་དང་། ཉེས་པའི་དྲི་ང་བ་མེད་དེ། མི་དགེ་བའི་རྟོགས་པ་ཐམས་ཅད་དང་བྲལ་བར་གྱུར་ཏོ།
en: All beings too acquired the paths of the ten virtuous actions, and they maintained the practice of chastity and purity, without the stench of immorality and without the notion of nonvirtue.

source: །དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་བདེ་བའི་རྣམ་པ་འདི་ལྟ་བུ་དང་ལྡན་པར་གྱུར་ཏེ། དཔེར་ན་དགེ་སློང་བསམ་གཏན་གསུམ་པ་ལ་སྙོམས་པར་ཞུགས་པའི་བདེ་བ་དེ་ལྟ་བུའི་བདེ་བ་ཐམས་ཅད་དང་ལྡན་པར་གྱུར་ཏོ།
en: At that time all beings possessed every kind of happiness such that their happiness resembled, by comparison, the happiness experienced by monks absorbed in the third meditative concentration.

source: །དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་རྣམ་པ་འདི་ལྟ་བུའི་ཤེས་རབ་དང་ལྡན་པར་གྱུར་ཏེ། འདི་ལྟར་སྦྱིན་པ་ནི་དགེ་བའོ།
en: At that time all beings possessed wisdom such that they knew as follows: “Excellent is generosity!

source: །ཞི་བ་ནི་དགེ་བའོ།
en: Excellent is peace!

source: །དུལ་བ་ནི་དགེ་བའོ།
en: Excellent is discipline!

source: །སྡོམ་པ་ནི་དགེ་བའོ།
en: Excellent is restraint!

source: །བདེན་པ་ནི་དགེ་བའོ།
en: Excellent is truth!

source: །བག་བྱེད་པ་ནི་དགེ་བའོ།
en: Excellent is carefulness!

source: །བྱམས་པ་ནི་དགེ་བའོ།
en: Excellent is loving kindness!

source: །སྙིང་རྗེ་ནི་དགེ་བའོ།
en: Excellent is compassion!

source: །ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་ནི་དགེ་བའོ།
en: Excellent is the practice of chastity!

source: །སྲོག་ཆགས་སུ་གྱུར་པ་ཐམས་ཅད་ལ་མི་འཚེ་བ་འདི་ནི་དགེ་བའོ། །ཞེས་བྱ་བར་ཤེས་པར་གྱུར་ཏོ།
en: Excellent is nonviolence with respect to all living creatures!”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་གདན་སེང་གེའི་ཁྲི་དེ་ཉིད་ལ་བཞུགས་པས་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་བསྒྲིབས་པ་མེད་པ་ནམ་མཁའི་དབྱིངས་ཡོངས་སུ་དག་པ་ལ་འདུག་པའམ། ཟླ་བ་ཉ་བའི་ཟླ་བའི་དཀྱིལ་འཁོར་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རི་རབ་དང་བཅས་པ། ཁོར་ཡུག་དང་བཅས་པ། ལྷའི་གནས་དང་བཅས་པ། དབང་པོ་དང་བཅས་པ།
en: At that time the Blessed One, seated on the lion throne, resembled, as an analogy, the unobscured sun in the pure expanse of space, or the orb of the full moon.

source: དབང་བྱེད་དང་བཅས་པ། ལྷ་དང་། ལྷ་མ་ཡིན་གྱི་རིས་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། གཙང་མའི་གནས་དང་བཅས་པ་འདི་ཟིལ་གྱིས་མནན་ཏེ་བཞུགས་ན།
en: His light filled this great trichiliocosm, with its Mount Sumerus and all that surrounded them, its god realms, Indra realms, Vaśavartin realms, gods, asuras, Brahmā realms, and Pure Abodes, outshining them all.

source: འོད་དང་སྐུ་མདོག་དང་། གཟི་བརྗིད་དང་དཔལ་གྱིས་མཛེས་ཤིང་། ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཟིལ་གྱིས་མནན་ཏེ། འོད་དང་། སྐུ་མདོག་དང་། གཟི་བརྗིད་དང་། དཔལ་གྱིས་མཛེས་ཤིང་། ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེར་བཞུགས་པ་དེ་བཞིན་དུ།
en: While he remained seated, he himself was adorned with light, of lustrous complexion, sparkling, gleaming, and shining in splendor and glory.

source: ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཟིལ་གྱིས་མནན་ཏེ། འོད་དང་། སྐུ་མདོག་དང་། གཟི་བརྗིད་དང་དཔལ་གྱིས་མཛེས་ཤིང་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེར་བཞུགས་སོ། །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་།
en: And while the Blessed One remained seated, outshining this great trichiliocosm, adorned with light, of lustrous complexion, sparkling, gleaming, and shining in splendor and glory, he similarly outshone the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, being adorned with light, of lustrous complexion, sparkling, gleaming, and shining in splendor and glory.

source: ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཟིལ་གྱིས་མནན་ཏེ། འོད་དང་། སྐུ་མདོག་དང་། གཟི་བརྗིད་དང་། དཔལ་གྱིས་མཛེས་ཤིང་། ལྷམ་མེ་ལྷན་ནེ། ལྷང་ངེར་བཞུགས་སོ། །འདི་ལྟ་སྟེ་དཔེར་ན། རིའི་རྒྱལ་པོ་རི་རབ་རི་ནག་པོ་གཞན་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པར་གནས་པ་ནི་མཛེས་ཤིང་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །འདི་ལྟ་སྟེ་དཔེར་ན། ཟླ་བའི་དཀྱིལ་འཁོར་སྐར་མའི་གཟུགས་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པར་གནས་པ་ནི་མཛེས་ཤིང་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །འདི་ལྟ་སྟེ་དཔེར་ན།
en: Similarly, he outshone the world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, being adorned with light, of lustrous complexion, sparkling, gleaming, and shining in splendor and glory.

source: ཉི་མའི་དཀྱིལ་འཁོར་འོད་གཞན་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པར་གནས་པ་ནི་མཛེས་ཤིང་། ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ལྷ་དང་བཅས་པ། དབང་པོ་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། གཙང་མའི་གནས་དང་བཅས་པ། ཟིལ་གྱིས་ནོན་པར་བཞུགས་པ་ཡང་འོད་དང་། སྐུ་མདོག་དང་། གཟི་བརྗིད་དང་དཔལ་གྱིས་མཛེས་ཤིང་། ལྷམ་མེ།
en: Just as Sumeru, king of mountains, continues to outshine all other dark mountains, beautiful, sparkling, gleaming, and shining; just as the orb of the moon continues to outshine all the constellations of stars, adorned, sparkling, gleaming, and shining; and just as the orb of the sun continues to outshine all other lights, adorned, sparkling, gleaming, and shining, so did the Blessed One, adorned with light, of lustrous complexion, sparkling, gleaming, and shining in splendor and glory, outshine the worlds of the ten directions, with their gods, Indra realms, Brahmā realms, and Pure Abodes.

source: ལྷན་ནེ། ལྷང་ངེའོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར། བཅོམ་ལྡན་འདས་ཀྱིས་རང་བཞིན་གྱི་སྐུ་ཅི་འདྲ་བ་དེ་བཞིན་དུ་བསྟན་ཏོ། །དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་གཙང་མའི་གནས་ཀྱི་ལྷའི་རིས་དང་། ཀུན་སྣང་དང་བ་དང་། ཚངས་རིས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། འཕྲུལ་དགའ་དང་།
en: Then the Blessed One again showed, in this great trichiliocosm, his own original body just as it is.

source: དགའ་ལྡན་དང་། མཚེ་མ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་གང་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཀྱིས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གདན་སེང་གེའི་ཁྲི་ལ་བཞུགས་པ་མཐོང་ནས།
en: All the gods, as many as there are, of the Pure Abodes, {Dt.11} the Ābhāsvara realms, the Brahmā realms, and the Para­nirmita­vaśa­vartin, Nirmāṇarata, Tuṣita, Yāma, Trayastriṃśa, and Caturmahā­rāja­kāyika realms, saw the tathāgata, arhat, completely awakened Buddha seated on the lion throne.

source: དགའ་ཞིང་སྤྲོ་བ་དང་། ཡིད་བདེ་ཞིང་རབ་ཏུ་དགའ་ལ་ཉམས་བདེ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་།
en: They were delighted.

source: ཕྲེང་བ་དང་། སྤོས་དང་།
en: They rejoiced.

source: བྱུག་པ་དང་། ཕྱེ་མ་དང་། ལྷ་རྫས་ཀྱི་བྱུག་སྤོས་དང་། ལྷ་རྫས་ཀྱི་ཨུཏྤལ་དང་། པད་མོ་དང་། ཀུ་མུད་དང་། པུན་ད་རི་ཀ་དང་། ན་ལི་ན་དང་།
en: They were contented.

source: སཽ་གན་དྷི་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་གེ་སར་དང་། ཏ་མ་ལའི་ལོ་མ་དང་། ལྷ་རྫས་ཀྱི་ན་བཟའ་དང་། རྒྱན་དང་།
en: Their extreme joy gave rise to such delight and contentment that they took many heavenly flowers, garlands, perfumes, unguents, powders, and heavenly pastes; heavenly blue lotuses, day lotuses, night lotuses, white lotuses, water lilies, and fragrant water lilies; and heavenly crocuses, mangosteen leaves, heavenly robes, ornaments, parasols, victory banners, and heavenly ribbons, and set out for the place where the Blessed One was seated.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། ལྷ་རྫས་ཀྱི་བ་དན་མང་པོ་ཐོགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། བྱུག་སྤོས་དང་། ཨུཏྤལ་དང་། པད་མོ་དང་། ཀུ་མུད་དང་། པུན་ད་རི་ཀ་དང་། ན་ལི་ན་དང་། སཽ་གན་དྷི་དང་། མེ་ཏོག་གེ་སར་དང་། ཏ་མ་ལའི་ལོ་མ་དང་། ལྷ་རྫས་ཀྱི་ན་བཟའ་དང་། རྒྱན་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: Going there, they sprinkled, scattered, and showered down upon the Blessed One those flowers, garlands, perfumes, unguents, powders, pastes, blue lotuses, day lotuses, night lotuses, white lotuses, water lilies, fragrant water lilies, crocuses, mangosteen leaves, heavenly robes, ornaments, parasols, victory banners, and heavenly ribbons.

source: ལྷའི་བ་དན་དག་གིས་བཅོམ་ལྡན་འདས་ལ་གཏོར་ཏོ། མངོན་པར་གཏོར་ཏོ། །མངོན་པར་རབ་ཏུ་གཏོར་ཏོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་འདུལ་བ་དང་། སྣོད་དུ་གྱུར་པའི་མི་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་མེ་ཏོག་ཆུ་ལས་སྐྱེས་པ་དང་། ཐང་ལས་སྐྱེས་པ་མང་པོ་ཁྱེར་ནས།
en: All human beings who were disciplined and suitable recipients of the teachings, as many as there were in this great trichiliocosm, also brought all kinds of flowers, ones that grow in water and grow on the plains, and they set out for the place where the Blessed One was seated.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ། །མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་ལ་སོགས་པ་དང་། ན་བཟའ་དང་། རྒྱན་དང་། གདུགས་དང་།
en: Going there, they offered these to the Blessed One.

source: རྒྱལ་མཚན་དང་། བ་དན་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་མ་ཐག་ཏུ། བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་སྟེང་གི་ནམ་མཁའ་ལ་མེ་ཏོག་ལ་སོགས་པའི་ཁང་པ་བརྩེགས་པ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་དུ་རེད་དེ་གནས་པར་གྱུར་ཏོ།
en: Through the blessings of the Blessed One all these flowers, garlands, perfumes, unguents, powders, and so forth, and the robes, ornaments, parasols, victory banners, and ribbons, immediately formed a towering mansion of flowers and the like, extending into the sky above the head of the Blessed One, and as large as the great trichiliocosm.

source: །ཁང་པ་བརྩེགས་པ་དེ་ལས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། དར་གྱི་ལྡ་ལྡི་མང་པོ་འཕྱང་བར་གྱུར་ཏོ། །མངོན་པར་འཕྱང་བར་གྱུར་ཏོ། །རབ་ཏུ་འཕྱང་བར་གྱུར་ཏོ།
en: From that towering mansion, heavenly flowers and many wreaths of silk were suspended, draped, and floated in the air.

source: །མེ་ཏོག་དང་། དར་གྱི་ལྡ་ལྡི་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཤིན་ཏུ་མཛེས་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱི་འོད་སྣང་བ་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དེས་ཀྱང་ཤིན་ཏུ་མཛེས་ཤིང་། ལྷམ་མེ། ལྷན་ནེ།
en: This whole great trichiliocosm was exquisitely adorned by the flowers and wreaths of silk, and it was exquisitely adorned, too, by the golden light of the Blessed One, sparkling, gleaming, and shining.

source: ལྷང་ངེར་གྱུར་ཏོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་། བཅོམ་ལྡན་འདས་ཀྱི་འོད་སྣང་བ་དེས་ཁྱབ་ཅིང་གསལ་བར་གྱུར་ཏོ།
en: In this great trichiliocosm the world systems of the eastern direction, as many as the grains of sand of the river Gaṅgā, were permeated and illuminated by that light of the Blessed One.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་། བཅོམ་ལྡན་འདས་ཀྱི་འོད་སྣང་བ་དེས་ཁྱབ་ཅིང་གསལ་བར་གྱུར་ཏོ།
en: The world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, were also permeated and illuminated by that light of the Blessed One. {

source: །དེ་ལ་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ནས། འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། །དེ་བཞིན་གཤེགས་པ་བདག་ཅག་གི་མདུན་ན་བཞུགས་ཤིང་ཆོས་སྟོན་ཏོ་སྙམ་མོ། །འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཇི་ལྟར་སེམས་པ་དེ་བཞིན་དུ། ནུབ་ཀྱི་བ་ལང་སྤྱོད་དང་། ཤར་གྱི་ལུས་འཕགས་པོ་དང་། བྱང་གི་སྒྲ་མི་སྙན་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་བར་དང་།
en: Dt.12} There, the human beings of the Jambudvīpas beheld the body of the Tathāgata that one can never tire of beholding, thinking, “The Tathāgata is seated before us, teaching the Dharma.”

source: དེ་བཞིན་དུ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མི་ཐམས་ཅད་དང་ལྷ་ཐམས་ཅད་ཀྱིས། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ནས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་བདག་ཅག་གི་མདུན་ན་བཞུགས་ཤིང་ཆོས་སྟོན་ཏོ་སྙམ་མོ།
en: And just as the human beings of the Jambudvīpas had that thought, in the same manner, the inhabitants of the Aparagodānīyas, Pūrvavidehas, and Uttarakurus, the gods of Caturmahā­rāja­kāyikas, and those of the other realms, up to and including the Akaniṣṭhas, and similarly all the human beings and all the gods of the chiliocosm, the dichiliocosm, and the great trichiliocosm, beheld the body of the Tathāgata that one can never tire of beholding, thinking, “The Tathāgata is seated before us, teaching the Dharma.”

source: །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་གདན་སེང་གེའི་ཁྲི་དེ་ལ་བཞུགས་བཞིན་དུ། འོད་རབ་ཏུ་དགྱེ་བ་མཛད་དེ། ཡང་འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རབ་ཏུ་སྣང་བར་གྱུར་ཏོ།
en: Then again, while seated on that lion throne, the Blessed One sent forth lights that illuminated this great trichiliocosm.

source: །ཤར་ཕྱོགས་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རབ་ཏུ་སྣང་བར་གྱུར་ཏོ།
en: He illuminated all the world systems of the eastern direction, and each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā.

source: །འོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་བཅས་པ་མང་པོ་མཐོང་བར་གྱུར་ཏོ།
en: Through that light all beings, as many as there were in this great trichiliocosm, beheld the many tathāgatas, arhats, completely awakened buddhas of the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, along with their monastic communities of śrāvakas and their assemblies of bodhisattvas.

source: །ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ན། སེམས་ཅན་གང་ཇི་སྙེད་འཁོད་པ་དེ་དག་གིས་ཀྱང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པ་མཐོང་བར་གྱུར་ཏོ།
en: And in these world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, those assemblies of beings, as many as there were, also beheld in this great trichiliocosm the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, residing together with the community of monks and the assembly of bodhisattvas.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་ན། སེམས་ཅན་གང་ཇི་སྙེད་འཁོད་པ་དེ་དག་གིས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པ་མཐོང་བར་གྱུར་ཏོ།
en: Similarly, in the world systems of each of the other cardinal directions—south, west, and north—and those of the intermediate directions—northeast, southeast, southwest, and northwest—along with those of the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, those assemblies of beings, as many as there were, also beheld in this great trichiliocosm the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, residing together with the community of monks and the assembly of bodhisattvas.

source: །དེ་ནས་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་ཡོད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Beyond all the world systems in the eastern direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Ratnavatī.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resided and lived the tathāgata, arhat, completely awakened buddha called Ratnākara, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་འབྱུང་གནས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Samantaraśmi who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Ratnākara was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོགས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན།
en: Going there, he asked that blessed one, the tathāgata Ratnākara, the following: “Blessed Lord, what are the causes {Dt.13} and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Ratnākara, replied to the bodhisattva great being Samantaraśmi, “Noble son, west from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་ངོ་།
en: There a tathāgata, arhat, completely awakened buddha named Śākyamuni resides and is alive at present.

source: །དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་ཏེ།
en: He teaches the perfection of wisdom to bodhisattva great beings.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཟེར་ཀུན་ནས་འབྱུང་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འབྱུང་གནས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར།
en: Such is his power.”
